Hi @redRolf, I can't reproduce your issue with the latest version:

```hcl
terraform {
  required_providers {
    exoscale = {
      source  = "exoscale/exoscale"
      version = "0.23.0"
    }
  }
}

locals {
  zone = "ch-gva-2"
}


resource "exoscale_security_group" "test" {
  name = "test-gh100"
}

resource "exoscale_security_group_rule" "nessus_server-egress-tcp" {
  security_group_id = exoscale_security_group.test.id
  type              = "EGRESS"
  protocol          = "TCP"
  cidr              = "0.0.0.0/0"
  start_port        = 1
  end_port          = 65535
  description       = "allow scanning of all ports"
}
```

```console
$ terraform apply

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # exoscale_security_group.test will be created
  + resource "exoscale_security_group" "test" {
      + id   = (known after apply)
      + name = "test-gh100"
    }

  # exoscale_security_group_rule.nessus_server-egress-tcp will be created
  + resource "exoscale_security_group_rule" "nessus_server-egress-tcp" {
      + cidr                = "0.0.0.0/0"
      + description         = "allow scanning of all ports"
      + end_port            = 65535
      + id                  = (known after apply)
      + protocol            = "TCP"
      + security_group      = (known after apply)
      + security_group_id   = (known after apply)
      + start_port          = 1
      + type                = "EGRESS"
      + user_security_group = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

exoscale_security_group.test: Creating...
exoscale_security_group.test: Creation complete after 1s [id=1361dcd5-b10b-4ccc-af64-425aee02cc9f]
exoscale_security_group_rule.nessus_server-egress-tcp: Creating...
exoscale_security_group_rule.nessus_server-egress-tcp: Creation complete after 7s [id=8f2c7d67-5271-4197-a4db-2f7e58be73ee]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.

$ terraform apply
exoscale_security_group.test: Refreshing state... [id=1361dcd5-b10b-4ccc-af64-425aee02cc9f]
exoscale_security_group_rule.nessus_server-egress-tcp: Refreshing state... [id=8f2c7d67-5271-4197-a4db-2f7e58be73ee]

Apply complete! Resources: 0 added, 0 changed, 0 destroyed.
```

Which version of the provider are you running? Also, do you mind sharing the current content of your `nessus_server` Security Group, e.g. using `exo firewall show ...`? This issue may be more related to the API than the TF provider itself (if sensitive information, you can open an Exoscale support ticket).